Repository: translate5/translate5
Catalog: application/modules/editor/testcases/editorAPI/Translate3117Test/resource1.tmx
Source language: de_de
Languages: en_uk, en_us

source: Dies ist abhängig von der vor dem Start des Editors gewählten Sprache.
en_uk: This depends on the language selected before the editor started.

source: Je nach Einstellung geschieht dies entweder vollautomatisch ohne Nachfrage, mit Nachfrage, welche Wiederholungen genau ersetzt werden sollen.
en_uk: Depending on the setting, this happens either fully automatically without request or with request, exactly which repetitions are to be replaced.

source: Zusätzlich wird darüber informiert, ob das aktuell angezeigte Segment in der aktuellen Filterung der Segmentübersicht ein- oder ausgeblendet ist.
en_uk: In addition, the user is notified, whether the currently displayed segment is faded in or out in the current filtering of the segment overview.

source: Im Gegensatz zu anderen Lektoratslösungen ist translate5 dazu in der Lage, auch Wiederholungen automatisch zu ersetzen, die nur in der Zielsprache identisch sind, sich aber in der Ausgangssprache unterscheiden.
en_uk: Compared to other editing solutions, translate5 is also capable of automatically replacing repetitions, which are only identical in the target language, but differ in the source language.

source: Sie stehen dem Lektor dann in einem eigenen ausklappbaren Bereich zum Download zur Verfügung.
en_uk: They are then available to the editor in its own collapsible section for downloading.

source: Im Mouseover kann hier bereits der volle Tag gesehen werden, der im bilingualen Format eigentlich vorhanden ist.
en_uk: In mouse-over, the full tag can already be seen here, which actually exists in the bi-lingual format.

source: Speichert der Lektor ein Segment, erhält dies automatisch den Autostatus "Lektoriert".
en_uk: If the editor saves a segment, it gets automatically the auto status "Edited".

source: Ergonomic Mode - Reduktion der Ansicht auf das Wesentliche
en_uk: Ergonomic Mode Reduction of the Display to the Essentials

source: Tags sind in translate5 wie gewohnt als kleine grafische Einheiten sichtbar.
en_uk: Tags are visible in translate5, as usual, as small, graphic units.

source: Im Standard ist der Kurztag-Modus aktiv.
en_uk: In standard, the short-tag mode is active.

source: Flexibel anpassbare Ansicht Ein- und Ausblenden von Spalten, Umgruppieren von Spalten etc.
en_uk: Flexibly adjustable display Fading in and out of columns, restructuring columns, etc.

source: Ein Bildschirmfoto mit den wichtigsten Features finden Sie auf unserer Überblicksseite.
en_uk: For a screenshot with the most important features, please see our overview page.

source: translate5 nutzt für die Terminologieauszeichnung den XliffTermTagger von Prof. Klemens Waldhör, der ebenfalls unter Open Source-Lizenz steht.
en_uk: For terminology labelling, translate5 uses the XliffTermTagger by Prof. Klemens Waldhör, which is also licensed under Open Source.

source: Kurz gesagt beinhaltet die von QTLaunchpad entwickelte Multidimensionale Qualtätsmetrik (MQM) ein Konzept und eine Vorgehensweise, um Übersetzungsqualität nach einheitlichen Maßstäben zu definieren und zu messen - unabhängig davon ob die Übersetzung durch einen Menschen oder eine Maschine angefertigt wurde.
en_uk: In short, the multi-dimensional quality metrics (MQM) developed by QTLaunchpad includes a concept and a procedure to define and measure translation quality according to uniform standards - regardless of whether the translation was done by a human or a machine.

source: Suchmaschinenoptimierung
en_uk: Search Engine Optimization

source: Die moderne Softwarearchitektur von translate5 ermöglicht es, zehntausende von Segmenten und hunderte von Dateien gleichzeitig in einer Segmentübersicht zu lektorieren und trotzdem den Überblick zu behalten und hochperformant zu arbeiten.
en_uk: The state-of-the-srt software architecture of translate5 makes it possible to edit tens of thousands of segments and hundreds of files in a segment overview at the same time and still stay on top of things and work highly efficiently.

source: Die importieren Dateien eines Projekts werden in translate5 mit Hilfe eines Dateibaumes dargestellt.
en_uk: The imported files of a project are displayed in translate5 with the help of a file tree.

source: Dieser Dateibaum ist dem Windows Explorer nachempfunden und besitzt beliebig viele ein- und ausklappbare Ordnerhierarchien.
en_uk: This file tree is modelled after Windows Explorer and has any number of folder hierarchies that can be collapsed and unfolded.

source: Die Ordnerhierarchien spiegeln die Ordnerstruktur des Importverzeichnisses wieder und ermöglichen es, hunderte von Dateien übersichtlich zu strukturieren.
en_uk: The folder hierarchies reflect the folder structure of the import index and make it possible to structure hundreds of files efficiently.

source: Testen Sie translate5 sofort, kostenlos und ohne Registrierung unter translate5.net!
en_uk: Test translate5 Immediately, Free of Charge, and Without Registration at translate5.net!!

source: Sie möchten, dass Ihr translate5 automatisch ständig auf dem aktuellsten Entwicklungsstand ist?
en_uk: You would like your translate5 to be always automatically updated?

source: Sie möchten die Vorteile einer Webapplikation nutzen und translate5 auch an mehreren Standorten flexibel einsetzen können?
en_uk: You would like to use the advantages of a web application and also be able to use translate5 in several sites?

source: Gern unterbreiten wir Ihnen hierfür ein Angebot!
en_uk: We will be happy to make you an offer for that!

source: translate5 Hosting Ihrer translate5-Instanz
en_uk: translate5 Hosting your translate5 entity

source: Hosting Ihrer translate5-Instanz
en_uk: Hosting Your translate5 Entity

source: translate5 Quellcode auf github
en_uk: translate5 Source Code on github

source: Der letzte Stand der Entwicklung von translate5 ist jeweils auf github veröffentlicht.
en_uk: The latest update of the development of translate5 is always published on github.

source: Das hierarchisch oberste Repository ist "translate5", welches die Abhängigkeiten als git-submodule oder Verweise enthält.
en_uk: The top repository in the hierarchy is translate5, which contains the dependencies as a git-sub module or links.

source: 2005 führte er Across im Großkundeneinsatz ein und leitete seit 2006 mit dem "Bereich Systemintegration und Entwicklung" die IT des Übersetzungsbereichs.
en_uk: In 2005, he introduced Across for wholesale use and, starting in 2006, was in charge of IT of the translation division in the "area of system integration and development.
en_us: In 2005, he introduced Across for wholesale use and, starting in 2006, was in charge of IT of the translation division in the "area of system integration and development.

source: Nebenberuflich ist Marc Mittag Vater dreier Kinder, die ihm sehr wichtig sind.
en_uk: Aside from his job, Marc Mittag is father of three children who are very important to him.
en_us: Aside from his job, Marc Mittag is father of three children who are very important to him.

source: translate5 selbst weiterentwickeln
en_uk: Developing translate5 on Your Own

source: Eine Reihe dieser Faktoren sind harte IT-Fakten, hier bedarf es handfester Kenntnisse über Webtechnologien und Webentwicklung
en_uk: A number of these factors are hard IT facts, in this case, concrete knowledge about web technologies and web development is necessary

source: Testen Sie uns !
en_uk: Test us !

source: Sie hätten gern mehr Einfluss auf Ihre Übersetzungsprozesse, als dies normaler Weise mit Across oder Trados möglich ist?
en_uk: You would like to have more influence on your translation processes than it is normally possible with Across or Trados?

source: Wir beraten und unterstützen Sie gern!
en_uk: We will be happy to consult and help you!

source: Consulting zur Optimalen Verwendung
en_uk: Consulting for Optimum Usage

source: Der Across Language Server verfügt heute über eine Vielzahl von administrativen Einstellungs- und Konfigurationsmöglichkeiten, die auf komplexe Weise ineinander greifen.
en_uk: The Across Language Server has a multitude of administrative settings and configuration options interlocking in a complex way.

source: Auf Wunsch übernehmen wir gern die administrative Betreuung Ihrer Across-Anwendung per Fernwartung!
en_uk: On request, we will be happy to take over the administrative support of your Across application via remote maintenance!

source: Serveradministration des Across Language Servers
en_uk: Server Administration of Across Language Servers

source: Zusätzlich muss bei der initialen Einrichtung von Across die externe Kommunikation des Across Language Servers via crossGrid, crossWan Online, crossWan Load, crossWeb und crossTerm Web mit den Sicherheitsanforderungen Ihrer IT und Ihrer Firewall in Einklang gebracht werden.
en_uk: In addition, when initially installing Across, the external communication of the Across Language Server via crossGrid, crossWan Online, crossWan Load, crossWeb, and crossTerm Web must be aligned with the safety requirements of your IT and your firewall.

source: Diese übernehmen eine solche Umkonvertierung dann automatisch ‒ sogar ohne dass der Projektmanager davon etwas merkt.
en_uk: These assume such a conversion then automatically - even without the project manager noticing this.

source: Automatisierung der Prozesse des Across Language Servers
en_uk: Automation of Processes of Across Language Servers

source: Across ist ein hochkomplexes Werkzeug, mit dem sich viel in Ihrem Unternehmen erreichen lässt.
en_uk: Across is a highly complex tool with which much can be achieved in your company.

source: In unseren Augen ist jedoch eine Voraussetzung für den zeitlich gesehen effizienten Einsatz von Across, dass möglichst viele Prozesse in und um Across automatisiert werden.
en_uk: However, from our point of view, it is necessary for Across' efficient use in terms of time that as many processes as possible in and around Across are automated.

source: Dies geht nicht immer und in allen Fällen (man denke an nativ nicht zu übersetzende Formate wie PDF oder schlecht formatierte Word-Dateien), jedoch lässt sich durch eine intelligente Automatisierung des Across Language Servers selbst in diesen Fällen ein Großteil des Übersetzungsprozesses in und um Across automatisieren.
en_uk: This does not work at all times and in all cases (think of formats like pdf or poorly formatted word files, which natively cannot be translated), but by automating the Across Language server itself in these cases, a large part of the translation process in and around Across can be automated.

source: Hier können wir punkten.
en_uk: Here, we can score.

source: Unabhängig davon, ob Sie Ihre Across-Prozesse intern selbst automatisieren möchten, dies von Across durchführen lassen möchten oder Dritte beauftragen möchten ist ein externes drittes Auge wichtig, um ein optimales Konzept zu erstellen!
en_uk: Regardless of whether you would like to automate your Across processes internally yourself, have this done by Across, or assign third parties, an external third eye is important to create an optimal concept!

source: Fragen Sie uns an !
en_uk: Ask us !

source: Die Einstellungen sind für den erfahrenen Übersetzungsmanager überschaubarer, können aber dennoch insbesondere hinsichtlich einer sauberen Translation Memory- oder Terminologieverwendung oder der korrekten Einstellung komplexer Dateiformate ihre Tücken haben.
en_uk: The settings are more manageable for the translation manager, though they can have their drawbacks, particularly in regard to the usage of a clean translation memory or terminology or in regard to the correct setting of complex file formats.

source: Gern beraten wir Sie zur optimalen Einstellung von SDL Trados Studio, erstellen Einstellungsvorlagen für Ihre Dateien oder bereiten Ihre Dateien technisch für die Übersetzung mit Trados vor!
en_uk: We will be happy to assist you in the optimal set-up of SDL Trados Studio, create setting templates for your files, or technically prepare your files for translation with Trados!

source: Kontaktieren Sie uns !
en_uk: Contact us!

source: translate5 als Review-Client für Ihr Unternehmen
en_uk: translate5 as a Review Client for your Company

source: translate5 kann dies für Sie leisten !
en_uk: translate5 can achieve this for you !

source: Fragen Sie uns zu Serverinstallationen für Ihr Unternehmen oder maßgeschneiderten Integrationen in Ihre bestehende IT-Landschaft !
en_uk: Ask us about server installations for your company or tailor-made integrations to your existing IT-landscape !

source: Oder legen Sie selbst Hand an !
en_uk: Or do it yourself !

source: translate5, openTMS und openTM2
en_uk: translate5, openTMS, and openTM2

source: translate5, openTMS und openTM2 sind die Open Source-Newcomer unter den Übersetzungswerkzeugen ‒ und gleichzeitig ein alter Bekannter:
en_uk: translate5, openTMS, and openTM2 are Open Source newcomers among translation tools ‒ and at the same time old friends:

source: Damit steht eines der Werkzeuge für technische Übersetzung, das am längsten am Markt ist, nun unter Open Source Lizenz.
en_uk: So, one of the tools for technical translation, which has been on the market the longest, is now under Open Source license.

source: Open Source-Übersetzungs-Serverlösung für Ihr Unternehmen
en_uk: Open Source Translation Server Solution for Your Company

source: openTM2 bringt eine ausgereifte Desktoplösung für hocheffizientes Arbeiten des Übersetzers mit. openTMS stellt eine moderne, performante Serverarchitektur für die Translation Memory Verwaltung ‒ mit interessanten Features wie einer Phrasensuche.
en_uk: openTM2 brings along a well-engineered destop solution for highly efficient working of the translator. openTMS delivers state-of-the-art, performant server architecture for Translation Memory administration‒ with interesting features like phrase search.

source: Zusammen ergibt sich eine serverbasierte Übersetzungslösung unter Open Source-Lizenz ‒ mit vielen interessanten Features!
en_uk: Together, these result in a server-based translation solution under Open Source license - with many interesting features!

source: Das bedeutet:
en_uk: That means:

source: Sie bereiten Dateien für die Übersetzung vor und nach und müssen dabei eine Vielzahl manueller Schritte gehen?
en_uk: You are pre- and post-processing files for translation and have to perform a multitude of manual steps?

source: Sie setzen Across oder SDL Trados Studio ein und Ihre Prozessabläufe sind extrem aufwendig oder führen immer wieder zu Qualitätsproblemen z. B. aufgrund verunreinigter oder mit Dubletten durchsetzter Translation Memories?
en_uk: You are applying Across or SDL Trados Studio and your work flows are extremely elaborate or time after time leading to quality problems e.g. due to translation memories that are contaminated or interspersed with duplicates?

source: Je nach Einstellung kann die Bedienung von Across für Projektmanager recht einfach sein und auch der verhältnismäßig hohe Klickaufwand für das Projektmanagement in Across kann so bereits reduziert werden.
en_uk: Depending on the setting, the operation of Across can be quite easy for the project manager and also the relatively high number of clicks for the project management in Across can already be reduced this way.

source: Bei schlechter Konfiguration oder einfacher Beibehaltung der Standard-Werte von Across kann aber auch ein ständig überhöhter Aufwand entstehen und die Gefahr inkonsistenter Datenbestände ist verhältnismäßig groß.
en_uk: With poor configuration or simple retention of standard values of Across, continuously excessive effort may also be the result, and the danger of inconsistent databases is relatively high.

source: Daher ist es insbesondere für Übersetzungsdienstleister, die Across einsetzen, aber auch für den Übersetzungsservice innerhalb von Industrieunternehmen von hoher Wichtigkeit, Across möglichst frühzeitig optimal zu konfigurieren.
en_uk: Therefore, it is very important, particularly for translation service providers using Across, but also for the translation service within companies, to configure Across as soon as possible to its optimum.

source: Ist das Kind bereits in den Brunnen gefallen, ist es wichtig, eine sinnvolle Strategie für eine Bereinigung der Datenbestände und einen Weg hin zur optimalen Konfiguration zu finden.
en_uk: If it is already too late, it is important to find a sensible strategy to clear up the databases and a way to optimal configuration.

source: Wir unterstützen Sie gern, beraten Sie zur optimalen Konfiguration und schulen Ihre IT und ihr Projektmanagement!
en_uk: We will be happy to help you, consult you for optimal configuration, and instruct you in your IT and your project management!

source: Als hochentwickeltes IT-System bedarf der Across Language Server einer optimal für ihre Anforderungen an Performance, Volumen und Backup angepasste IT-Infrastruktur.
en_uk: As a highly-developed IT-system, the Across Language Server needs an IT infrastructure optimally adapted to your demands in performance, volume, and back-up.

source: Je nach Auslastung und Belastung der Systeme können z. B. verschiedene Komponenten des Language Servers auf verschiedene Rechner verteilt werden oder sogar die Datenbanken vollständig in den Server-Hauptspeicher verlagert werden.
en_uk: Depending on the capacity and load of the systems, different components of the Language Server can, for example, be distributed to different computers, or the databases can even be entirely moved to the main memory of the server.

source: Wir beraten Sie gern in all diesen Fragen und übernehmen auf Wunsch per Fernzugriff die Administration Ihres Across Language Servers!
en_uk: We will be happy to consult you in all these issues and assume the administration of your Across Language Servers via remote maintenance on request!

source: Script-Entwicklung zur automatischen Vor- und Nachbereitung von Dateien für den Check-In in Across
en_uk: Script Development for Automatic Pre- and Post-Processing of Files for Check-In in Across

source: Bestimmte Dateiformate benötigen vor Ihrem Check-In in Across eine spezifische Umkonvertierung.
en_uk: Certain file formats need to be specifically converted before your Check-In in Across.

source: Dies gilt z. B. für bestimmte XML-Derivate, die nur so optimal für Across eingestellt werden können ‒ aber auch für andere Dateiformate.
en_uk: This is the case e.g. for certain XML-derivatives, which can only be optimally set for Across in such a way - but also for other file formats.

source: Across bietet dazu die Möglichkeit, alleine über die Systemkonfiguration Vor- und Nachbereitungsskripte zwischenzuschalten.
en_uk: Furthermore, Across has the option of executing pre- and post-processed scripts via the system configuration on its own.

source: Gern beraten wir Sie hier zu Ihrem Dateiformat oder schreiben Konvertierungsskripte für Sie!
en_uk: We will be happy to consult you here on your file format or write conversion scripts for you!

source: Notwendig dazu ist ein für Ihre Anforderungen maßgeschneidertes Konzept, welches direkt auf der crossAPI aufsetzt.
en_uk: For that, a concept tailor-made to your specifications is necessary, which is placed directly on the cross API.

source: Um ein solches Konzept zu erstellen ist viel Erfahrung in der Übersetzungsvor- und Nachbereitung, dem Prozesswissen zu Übersetzungsabläufen und tiefgreifende Entwicklungserfahrung in der Prozessautomatisierung der Übersetzungsbranche notwendig.
en_uk: To create such a concept, considerable experience in translation pre- and post-processing, in process knowledge of translation procedures and extensive experience in development in process automation of the translation industry is necessary.

source: Mit SDL Trados Studio besitzen Sie ein gegenüber komplexen Serverlösungen kleines, aber feines Schweizer Taschenmesser für ihre Übersetzungsprozesse.
en_uk: With SDL Trados Studio, you are owning, compared to complex server solutions, a small, yet excellent Swiss pocket knife for your translation processes.

source: Sie sind Übersetzungsdienstleister als eigenständige Agentur oder als Abteilung innerhalb Ihres Konzerns?
en_uk: You are a translation service provider as an independent agency or as a department within your corporation?

source: Sie suchen eine hochmoderne webbasierte Reviewlösung, die sich flexibel in Ihre Anforderungen einfügt und dennoch keine Lizenzkosten mit sich bringt?
en_uk: You are looking for a highly state-of-the-art, web-based review solution, which adapts to your demands, yet does not come with the costs of a license?

source: translate5 ist Open Source ‒ gern beraten wir Ihre Systemadministrationen in Wartung und Installation und schulen Ihre Entwickler hinsichtlich der Systemarchitektur!
en_uk: translate5 is Open Source ‒ we will be happy to consult your system administrations in maintenance and installation and instruct your developers in regard to system architecture!

source: Mit openTM2 hat IBM seinen Translation Manager als Open Source veröffentlicht.
en_uk: With openTM2, IBM published its Translation Manager as Open Source.

source: Und translate5 ist eine hochmoderner WebClient für Übersetzer und Lektoren, mit dem Anwender gern arbeiten.
en_uk: And translate5 is a highly state-of-the-art WebClient for translators and editors, with which users like to work.

source: Sie haben sich schon lange gefragt, ob Sie anstatt viel Geld für propertiäre Software auszugeben, die nicht wirklich Ihren Anforderungen entspricht und deren Entwicklung sie nicht beeinflussen können vielleicht lieber einen anderen Weg gehen sollten?
en_uk: You already have been asking yourself for a long time, if, rather than spending a lot of money on proprietary software, which does not meet your requirements and whose development you will not able to influence, you should take another route?

source: Sie haben Interesse daran, den optimalen Übersetzungsprozess für Ihr Unternehmen umzusetzen und selbst zu bestimmen, wie dieser aussehen soll?
en_uk: You are interested in implementing the optimal translation process for your company and deciding on your own, how this should look?

source: Sie suchen eine Software mit vielen interessanten Alleinstellungsmerkmalen, die dennoch günstig ist?
en_uk: You are searching for a software with many interesting, unique features, yet reasonably priced?

source: Wir beraten Sie gern, wie Sie openTM2, openTMS und translate5 zusammen zu einer optimalen Übersetzungslösung für Ihr Unternehmen kombinieren können!
en_uk: We will be happy to advise you, how you can integrate openTM2, openTMS, and translate5 combined to an optimal translation solution for your company!

source: Marc Mittag, Inhaber von MittagQI, unterrichtet "Yoga for business" vor dem Hintergrund einer eigenen 17-jährigen täglichen Yoga- und Meditationspraxis und seiner 14-jährigen Businessverantwortung.
en_us: Marc Mittag, owner of MittagQI, teaches “Yoga for business” against the backdrop of his own daily yoga and meditation practice of 17 years and his business responsibility of 14 years.

source: Nach seinem Studium übernahm er bei der Sturz Gruppe die Verantwortung für die Webseiten und Online Magazine der Gruppe, die er durch Suchmaschinenoptimierung schnell weit nach vorne brachte.
en_us: After graduation, he was in charge of the websites and online magazines of the “Sturz Gruppe”, which he significantly brought to the fore in a very short time with the help of good search engine optimization.
